In [1]:
import numpy as np
import pandas as pd

In [79]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [80]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [5]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

### 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [8]:
tempDF = pd.DataFrame(df.From_To)
tempDF.head()

            From_To
0      LoNDon_paris
1      MAdrid_miLAN
2  londON_StockhOlm
3    Budapest_PaRis
4   Brussels_londOn

In [13]:
tempDF['From'] = tempDF.From_To.str.split('_').str[0]

In [14]:
tempDF['To'] = tempDF.From_To.str.split('_').str[1]

In [18]:
tempDF.drop("From_To", axis=1, inplace=True)

In [19]:
tempDF

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

### 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [20]:
tempDF['From'] = tempDF['From'].str.title()
tempDF['To'] = tempDF['To'].str.title()

In [21]:
tempDF

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

### 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [81]:
df = df.drop('From_To',1)
df = pd.concat([tempDF,df], axis = 1)
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan           NaN            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris           NaN          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"

### 5.Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [82]:
cols = pd.DataFrame(df['RecentDelays'].tolist(),columns=['delay_1','delay_2','delay_3'])

In [83]:
cols

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [84]:
df = df.drop('RecentDelays', 1)
df

       From         To  FlightNumber              Airline
0    London      Paris       10045.0               KLM(!)
1    Madrid      Milan           NaN    <Air France> (12)
2    London  Stockholm       10065.0  (British Airways. )
3  Budapest      Paris           NaN       12. Air France
4  Brussels     London       10085.0          "Swiss Air"

In [85]:
df.insert(3, "Delay_1", cols['delay_1'])
df.insert(4, "Delay_2", cols['delay_2'])
df.insert(5, "Delay_3", cols['delay_3'])
df

,From,To,FlightNumber,Delay_1,Delay_2,Delay_3,Airline
0,London,Paris,10045.0,23.0,47.0,NaN,KLM(!)
1,Madrid,Milan,NaN,NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065.0,24.0,43.0,87.0,(British Airways. )
3,Budapest,Paris,NaN,13.0,NaN,NaN,12. Air France
4,Brussels,London,10085.0,67.0,32.0,NaN,"""Swiss Air"""